#+TITLE: Ed Mastery
#+AUTHOR: Michael W Lucas
#+DATE: 2018
#+EMAIL: evan@mantle.co
#+CREATOR: Evan Nagle
#+TAGS: @ed @linux

* Chapter 1: Basics
  :PROPERTIES:
  :header-args: :results scalar
  :END:
** Resources
- [[https://www.gnu.org/software/ed/manual/ed_manual.html]]
- [[https://sanctum.geek.nz/arabesque/actually-using-ed/]]

** Open ed as an editor

#+BEGIN_SRC sh
ed -p "~ " data/todo
#+END_SRC

** Run ed from the command line.
#+BEGIN_SRC sh :results scalar
ed -s data/todo <<<',n'
#+END_SRC

#+RESULTS:
: 1	eat breakfast
: 2	buy groceries
: 3	sleep for nine hours
: 4	swing around the tree
: 5	call mom

** Run ed from the command line, passing an ed file containing directives

#+BEGIN_SRC sh
ed -s data/todo < data/print-lines.ed
#+END_SRC

#+RESULTS:
: 1	eat breakfast
: 2	buy groceries
: 3	sleep for nine hours
: 4	swing around the tree
: 5	call mom

** Append a line to a file

#+BEGIN_SRC sh
# a lone period means "I'm done"
ed -s data/todo <<<'a
learn how to use ed!
.
,p'

# replace Q with wq if you'd like to save your changes.
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: sleep for nine hours
: swing around the tree
: call mom
: learn how to use ed!

** Append lines at index

#+BEGIN_SRC sh
ed -s data/todo <<<'2a
learn how to use ed
and do something else
.
,p
Q'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: learn how to use ed
: and do something else
: sleep for nine hours
: swing around the tree
: call mom

* Chapter 10: Addresses
  :PROPERTIES:
  :header-args: :results scalar
  :END:
** Address symbols
|--------+---------------------------------|
| Symbol | Meaning                         |
|--------+---------------------------------|
| .      | Current address                 |
| $      | Last address                    |
| ;      | Current address to last address |
| -      | Previous                        |
| +      | Next                            |
| n,n    | Range                           |
|--------+---------------------------------|

** $p = print the last line

#+BEGIN_SRC sh
ed -s data/todo <<<'$p'
#+END_SRC

#+RESULTS:
: call mom

** <N1>n = print line N1

#+BEGIN_SRC sh
# print the second line
ed -s data/todo <<<'1+2'
#+END_SRC

#+RESULTS:
: sleep for nine hours

** <N1>,<N2>n = print lines N1 - N2

#+BEGIN_SRC sh
ed -s data/todo <<<'2,3n'
#+END_SRC

#+RESULTS:
: 2	buy groceries
: 3	sleep for nine hours

** = returns an address number (aka line number)

#+BEGIN_SRC sh
ed -s data/todo <<<'! echo "current index: "
.=' && echo

ed -s data/todo <<<'! echo "current index - 2:"
-2=' && echo

ed -s data/todo <<<'! echo "index of last line:"
$=' && echo

ed -s data/todo <<<'! echo "index of first line:"
1=' && echo
#+END_SRC

#+RESULTS:
#+begin_example
current index: 
5

current index - 2:
3

index of last line:
5

index of first line:
1
#+end_example

** p, n, l = print lines(s)
|----------------+----------------------------------------------------------------|
| Print Commands |                                                                |
|----------------+----------------------------------------------------------------|
| p              | Print line at current address                                  |
| n              | Print line and line number                                     |
| l              | Print line and EOL markers                                     |
| nl             | Print line with line number and EOL markers                    |
| ,p             | Print the entire file                                          |
| ;p             | Print from current address to end of file                      |
| -p             | Print previous line                                            |
| +p             | Print next line                                                |
| -2,+2p         | Print from two lines before => two lines after current address |
|----------------+----------------------------------------------------------------|
| Scrolling      |                                                                |
|----------------+----------------------------------------------------------------|
| z              | Print from current address and fill buffer.                    |
| <n>z           | Print from <n> address and fill buffer.                        |
| <n1>z<n2>      | Print from line n1 to n2, set address to n2                    |
|----------------+----------------------------------------------------------------|

*** Example to printing in segments

#+BEGIN_SRC sh
ed -s data/todo <<<'1,2p
$
! pwd
$-'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: call mom
: /Users/evannagle/Repos/org-me-up/notes/ed-mastery
: swing around the tree

** k = bookmarks
|----------------+----------------------------------------------------------------|
| Bookmarks      |                                                                |
|----------------+----------------------------------------------------------------|
| k<letter>      | Set bookmark at current address                                |
| '<letter>      | Return to bookmark                                             |
|----------------+----------------------------------------------------------------|

#+BEGIN_SRC sh
ed -s data/todo <<<"2ka
'a+
'a
'a-"
#+END_SRC

#+RESULTS:
: sleep for nine hours
: buy groceries
: eat breakfast

* Chapter 11: Text Editing
  :PROPERTIES:
  :header-args: :in-file data/todo :results scalar
  :END:

** u = undo

#+BEGIN_SRC sh
ed -s data/todo<<<'1m2
,n
u
! echo "---"
,n'
#+END_SRC

#+RESULTS:
#+begin_example
1	buy groceries
2	eat breakfast
3	sleep for nine hours
4	swing around the tree
5	call mom
---
1	eat breakfast
2	buy groceries
3	sleep for nine hours
4	swing around the tree
5	call mom
#+end_example

** a = append

#+BEGIN_SRC sh
ed -s data/todo <<<'2a
line 1
line 2
.
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: line 1
: line 2
: sleep for nine hours
: swing around the tree
: call mom

** c = change

#+BEGIN_SRC sh
ed -s data/todo <<<'2c
buy groceries at Whole Foods
.
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries at Whole Foods
: sleep for nine hours
: swing around the tree
: call mom

** i = insert

#+BEGIN_SRC sh
ed -s data/todo <<<'3i
This goes /above/ line 3
And so does this
.
3+2a
And this goes after line 3.
Adding 2 to adjust for lines above.
.
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: This goes /above/ line 3
: And so does this
: sleep for nine hours
: And this goes after line 3.
: Adding 2 to adjust for lines above.
: swing around the tree
: call mom

** d = delete

#+BEGIN_SRC sh
ed -s data/todo <<<'3d
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: swing around the tree
: call mom

** m = move line

<n1>m<n2> ==> n1 is the line *number*, starting at 1. n2 is the line *slot*, starting at 0.

- Move third item to the first slot: 3m0
- Move the last item to second slot: $m1
- Move the first item to last slot:1m$

#+BEGIN_SRC sh
ed -s data/todo <<<'2m3
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: sleep for nine hours
: buy groceries
: swing around the tree
: call mom

** t = copy line

#+BEGIN_SRC sh
ed -s data/todo <<< '2t2
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: buy groceries
: sleep for nine hours
: swing around the tree
: call mom

** r = insert file

#+BEGIN_SRC sh
ed -s data/todo <<< 'r data/todo2
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: sleep for nine hours
: swing around the tree
: call mom
: jump on a trampoline
: sleep in the shower

** W = insert into another file
** j = join lines

#+BEGIN_SRC sh
ed -s data/todo <<<'1a
, 
.
1,3j
,p'
#+END_SRC

#+RESULTS:
: eat breakfast, buy groceries
: sleep for nine hours
: swing around the tree
: call mom

* Chapter 100: File Manipulations
  :PROPERTIES:
  :header-args: :in-file data/todo :results scalar
  :END:
  
** f = Specify a filename for the current buffer.
** w = write to file
** <N1>,<N2>w = write part of the buffer to file
** e <file> = switch to another file
** E <file> = switch to another file, discard changes on current file
** ed = run ed without a file

#+BEGIN_SRC sh
ed -s <<< 'a
line 1
line 2
.
2m0
,p'
#+END_SRC

#+RESULTS:
: line 2
: line 1

** ed -s !'<command>' = run ed on a command

#+BEGIN_SRC sh
ed -s !'ls data' <<< '0a
====== Files in data folder: ======
.
,p'
#+END_SRC

#+RESULTS:
: ====== Files in data folder: ======
: dup.ed
: jabberwocky.poem
: links.ed
: print-lines.ed
: todo
: todo2

** r !<command> = run a command directly inside of ed

#+BEGIN_SRC sh
ed -s <<< 'a
running command `ls data`:
==========
.
r !ls data
3a
 <== first file 
.
3,4j
$a
 <== last file
.
$-,$j
,p'

#+END_SRC

#+RESULTS:
: running command `ls data`:
: ==========
: dup.ed <== first file 
: jabberwocky.poem
: links.ed
: print-lines.ed
: todo
: todo2 <== last file

** e !<command> = run a command and edit the output in a new buffer
** ! <command> = run command

* Chapter 101: Regular Expressions and Searches
  :PROPERTIES:
  :header-args: :in-file data/todo :results scalar
  :END:

** /<regex>/ prints FIRST matching line

#+BEGIN_SRC sh
ed -s data/todo <<< '/.*/'
#+END_SRC

#+RESULTS:
: eat breakfast

** // = search forward with same regex

#+BEGIN_SRC sh
ed -s data/todo <<< '/a/
//'
#+END_SRC

#+RESULTS:
: eat breakfast
: swing around the tree

** ?? = search backward with same regex

#+BEGIN_SRC sh
ed -s data/todo <<< '/a/
??'
#+END_SRC

#+RESULTS:
: eat breakfast
: call mom

** g/<regex>/p = GREP! find all matches and print

#+BEGIN_SRC sh
ed -s data/todo <<< 'g/ee/p'
#+END_SRC

#+RESULTS:
: sleep for nine hours
: swing around the tree

** <N1>,<N2>g/<regex>/p = grep within range

#+BEGIN_SRC sh
ed -s data/todo <<< '1,2g/e/p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries

** g/<regex>/d = delete all lines that match

#+BEGIN_SRC sh
ed -s data/todo <<< 'g/ee/d
,p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: call mom

** g/<regex>/m<N> = move matching lines to N

#+BEGIN_SRC sh
ed -s data/todo <<< 'g/ee/m0
,p'
#+END_SRC

#+RESULTS:
: swing around the tree
: sleep for nine hours
: eat breakfast
: buy groceries
: call mom

** G/<regex> = interactive regex, allows editing per match
** v/<regex>/ = find all non-matches

#+BEGIN_SRC sh
ed -s data/todo <<< 'v/ee/p'
#+END_SRC

#+RESULTS:
: eat breakfast
: buy groceries
: call mom

** V/<regex>/ interactive regex for non-matches, allows editing per match

* Chapter 110: Substitution
  :PROPERTIES:
  :header-args: :in-file data/todo :results scalar
  :END:

** s/<regex>/<replace>/ = replace

#+BEGIN_SRC sh
ed -s data/todo <<< '3s/ee/__EE__/
,n'
#+END_SRC

#+RESULTS:
: 1	eat breakfast
: 2	buy groceries
: 3	sl__EE__p for nine hours
: 4	swing around the tree
: 5	call mom

** %s/<regex>/<replace> = replace all

#+BEGIN_SRC sh
ed -s data/todo <<< '%s/ee/__EE__/
,n'
#+END_SRC

#+RESULTS:
: 1	eat breakfast
: 2	buy groceries
: 3	sl__EE__p for nine hours
: 4	swing around the tr__EE__
: 5	call mom

** \<N> = subexpression

#+BEGIN_SRC sh
# parenthesees need to be escaped!

ed -s data/todo <<< '%s/\([aeiou]\)/*\1*/g
,n'
#+END_SRC

#+RESULTS:
: 1	*e**a*t br*e**a*kf*a*st
: 2	b*u*y gr*o*c*e*r*i**e*s
: 3	sl*e**e*p f*o*r n*i*n*e* h*o**u*rs
: 4	sw*i*ng *a*r*o**u*nd th*e* tr*e**e*
: 5	c*a*ll m*o*m

* Chapter 111: Scripting
  :PROPERTIES:
  :header-args: :in-file data/todo :results scalar
  :END:

** Example

#+BEGIN_SRC sh
ed -s data/todo <<< '2d
w data/todo2.txt
! echo "==> data/todo2.txt"
,p
1m2
1d
w data/todo3.txt
! echo "==> data/todo3.txt"
,p
Q'

# let's cleanup
rm data/todo2.txt
rm data/todo3.txt
#+END_SRC

#+RESULTS:
: ==> data/todo2.txt
: eat breakfast
: sleep for nine hours
: swing around the tree
: call mom
: ==> data/todo3.txt
: eat breakfast
: swing around the tree
: call mom


